Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/mint-desktop.tmx
Source language: en
Languages: sv

source: Desktop icons
sv: Skrivbordsikoner

source: Better support for modern applications: Client-side decorations in GTK3 are better supported by composited window managers.
sv: Bättre stöd för moderna applikationer: För dekorationer på klientsidan ger GTK3 ett bättre stöd åt fönsterhanterare som stöder skrivbordseffekter.

source: Mutter is the default window and compositing manager for the GNOME 3 desktop environment. It is very stable and very reliable.
sv: Mutter är den fönster- och kompositionshanterare som är förinstallerad i skrivbordsmiljön GNOME 3. Den är mycket stabil och tillförlitlig.

source: Within the operating system, the <gui>window manager</gui> is the part which is responsible for:
sv: I operativsystemet ansvarar <gui>fönsterhanteraren</gui> för:

source: If Marco is not installed already, you can install it with <cmd>apt install marco</cmd>.
sv: Om Marco inte är installerad så kan du installera den med kommandot <cmd>apt install marco</cmd>.

source: Buttons labels:
sv: Knappetiketter:

source: Configure Compiz
sv: Ändra inställningar för Compiz

source: Mounted Volumes
sv: Monterade volymer

source: Configure Xfwm4
sv: Konfigurera Xfwm4

source: GPU rendering: Depending on your graphics card and your drivers, rendering with the GPU (as opposed to the CPU) can result in visual artefacts or screen tearing.
sv: GPU-rendering: Beroende på grafikkort och grafikdrivrutiner kan rendering med GPU, istället för CPU, resultera i bildstörningar som artefakter och visuella felaktigheter (screen tearing).

source: Large
sv: Stor

source: Mac style (Left)
sv: Mac-stil (vänster)

source: Window events (moving, resizing, focusing windows)
sv: Fönsterhändelser (flytta, ändra storlek och fokusera fönster)

source: Marco + Compositing
sv: Marco + skrivbordseffekter

source: If Mutter is not installed already, you can install it with <cmd>apt install mutter</cmd>.
sv: Om Mutter inte redan finns installerad så kan du installera den med <cmd>apt install mutter</cmd>.

source: Xfwm4 settings
sv: Inställningar för Xfwm4

source: Overview of some window managers
sv: Översikt över några fönsterhanterare

source: Here's a description of some of the window managers available.
sv: Här följer en beskrivning av de fönsterhanterare som finns tillgängliga.

source: Marco is the default window manager for the MATE desktop environment. It is very stable and very reliable. It can run with or without compositing.
sv: Marco är den förvalda fönsterhanteraren i skrivbordsmiljön MATE. Den är mycket stabil, pålitlig och kan köras med eller utan skrivbordseffekter.

source: Interface
sv: Användargränssnitt

source: Advantages
sv: Fördelar

source: Dark mode
sv: Mörkt läge

source: Automatically maximize nearly screen sized windows
sv: Maximera automatiskt fönster med nästan samma storlek som skärmen

source: Auto
sv: Automatisk

source: Metacity was the default window manager for the GNOME 2 desktop environment. It is very stable and very reliable. It can run with or without compositing.
sv: Metacity var den fönsterhanterare som användes i skrivbordsmiljön GNOME 2. Den är mycket stabil, pålitlig och kan köras med eller utan skrivbordseffekter.

source: Window Manager
sv: Fönsterhanterare

source: Double (HiDPI)
sv: Dubbel (HiDPI)

source: Text only
sv: Endast text

source: Trash
sv: Papperskorg

source: Use system font in titlebar
sv: Använd systemtypsnitt i titelfältet

source: Text below items
sv: Text under objekt

source: Prefer dark mode
sv: Välj i första hand mörkt läge

source: Tweak Xfwm4
sv: Modifiera Xfwm4

source: Place new windows in the center of the screen
sv: Placera nya fönster mitt på skärmen

source: Mutter settings
sv: Inställningar för Mutter

source: Desktop Settings
sv: Skrivbordsinställningar

source: Text beside items
sv: Text bredvid objekt

source: Compositing (shadows, animations, effects, GPU rendering)
sv: Skrivbordseffekter (skyggor, animationer, effekter, GPU-rendering)

source: Metacity + Compositing
sv: Metacity + skrivbordseffekter

source: Small
sv: Liten

source: If Openbox is not installed already, you can install it with <cmd>apt install openbox</cmd>.
sv: Om Openbox inte är installerad så kan du installera den med kommandot <cmd>apt install openbox</cmd>.

source: Icons only
sv: Endast ikoner

source: Compiz is a very impressive window manager, very configurable and full of amazing effects and animations. It is however the least reliable and the least stable.
sv: Compiz är en mycket imponerande fönsterhanterare med många anpassningsmöjligheter och otroliga skrivbordseffekter. Den är dock den minst pålitliga och stabila.

source: Let applications decide
sv: Låt programmen välja

source: Pros and cons of compositing
sv: För- och nackdelar med skrivbordseffekter

source: Windows
sv: Fönster

source: Traditional style (Right)
sv: Traditionell stil (höger)

source: Compiz settings
sv: Inställningar för Compiz

source: Show icons on menus
sv: Visa ikoner i menyer

source: Computer
sv: Dator

source: Reset Compiz settings
sv: Återställ Compiz-inställningar

source: Disadvantages
sv: Nackdelar

source: Buttons layout:
sv: Knapplayout:

source: Xfwm4 + Compositing
sv: Xfwm4 + skrivbordseffekter

source: Desktop
sv: Skrivbordet

source: Compton is a compositing manager. It can be used in combination with windows managers such as Marco, Metacity or Xfwm4. In Xfce, using Xfwm4+Compton is known to reduce screen tearing.
sv: Compton är en kompositionshanterare. Det kan användas tillsammans med fönsterhanterare som Marco, Metacity eller Xfwm4. I Xfce är Xfwm4+Compton känt för att minska bildflimmer.

source: Fine-tune desktop settings
sv: Finjustera skrivbordsinställningar

source: If Metacity is not installed already, you can install it with <cmd>apt install metacity</cmd>.
sv: Om Metacity inte redan är installerat kan du installera det med <cmd>apt install metacity</cmd>.

source: Network
sv: Nätverk

source: Icons
sv: Ikoner

source: Don't show window content while dragging them
sv: Visa inte fönsterinnehåll vid förflyttning

source: Better look &amp; feel: Window animations, shadows and transparency.
sv: Bättre utseende och känsla: Fönsteranimationer, skuggor och transparens.

source: Enable edge tiling when dropping windows on screen edges
sv: Aktivera kantdockning när fönster släpps på skärmkanter

source: This setting only affects applications which support dark mode
sv: Denna inställning påverkar bara program som stöder mörkt läge

source: If Compton is not installed already, you can install it with <cmd>apt install compton</cmd>.
sv: Om Compton inte är installerad så kan du installera den med kommandot <cmd>apt install compton</cmd>.

source: Resource usage: Compositing requires more resources. This can result in slower performance or reduced battery autonomy on laptop computers.
sv: Resursanvändning: Skrivbordseffekter kräver mer systemresurser. Detta kan innebära sämre prestanda eller reducerad batteridrift för bärbara datorer.

source: Buttons layout (CSD windows):
sv: Knapplayout (CSD-fönster):

source: Applications
sv: Program

source: If Xfwm4 is not installed already, you can install it with <cmd>apt install xfwm4</cmd>.
sv: Om Xfwm4 inte är installerad så kan du installera den med kommandot <cmd>apt install xfwm4</cmd>.

source: The Windows section lets you choose a window manager.
sv: I avsnittet Fönster kan du välja en fönsterhanterare.

source: User interface scaling
sv: Skalning av användargränssnitt

source: Home
sv: Hem

source: translator-credits
sv: Launchpad Contributions: Carl-Uno Olsson https://launchpad.net/~carl-uno Daniel Nylander https://launchpad.net/~yeager Gustav https://launchpad.net/~info-gustavholm Jan-Olof Svensson https://launchpad.net/~jan-olof-svensson Mazen Harake https://launchpad.net/~mazenh Mikael Hamre https://launchpad.net/~minimicke Nick Wick https://launchpad.net/~bugreporter41 Teditiks https://launchpad.net/~per-stahre Troken https://launchpad.net/~martin-trokenheim jema https://launchpad.net/~jerker-malm kristian https://launchpad.net/~kristianm24 tux-sven https://launchpad.net/~sven.b Åke Engelbrektson https://launchpad.net/~eson

source: Metacity settings
sv: Inställningar för Metacity

source: Prefer light mode
sv: Välj i första hand ljust läge

source: Click on the help button for more information about window managers. Use the 'wm-recovery' command to switch back to the default window manager. Use the 'wm-detect' command to check which window manager is running.
sv: Klicka på hjälpknappen för mer information om fönsterhanterare. Använd kommandot "wm-recovery" för att byta tillbaka till den förvalda fönsterhanteraren. Använd kommandot "wm-detect" för att kontrollera vilken fönsterhanterare som körs.

source: Marco settings
sv: Inställningar för Marco

source: Show icons on buttons
sv: Visa ikoner på knappar

source: Welcome to Desktop Settings.
sv: Välkommen till Skrivbordsinställningar.

source: Select the items you want to see on the desktop:
sv: Markera de objekt som du vill visa på skrivbordet:

source: Windows borders, title bars and window buttons
sv: Fönsterkanter, titelfält och fönsterknappar.

source: Xfwm4 is the default window manager for the Xfce desktop environment. It is very stable and very reliable. It can run with or without compositing.
sv: Xfwm4 är den förvalda fönsterhanteraren i skrivbordsmiljön Xfce. Den är mycket stabil, pålitlig och kan köras med eller utan skrivbordseffekter.

source: Icon size:
sv: Ikonstorlek:

source: Openbox is a fast and light-weight window manager.
sv: Openbox är en snabb och resurssnål fönsterhanterare.

source: Compiz is installed by default in Linux Mint. Note: It is not available in LMDE.
sv: Compiz finns förinstallerad i Linux Mint - dock inte i LMDE.

source: Toolbars
sv: Verktygsrader
